{"_id":{"$oid":"60d8c012ccd1d9750268a4f2"},"name":"The Sixth Sense","year":"1999","description":"A boy who communicates with spirits seeks the help of a disheartened child psychologist.","genre":{"name":"Thriller","description":"Thrillers are characterized and defined by the moods they elicit, giving viewers heightened feelings of suspense, excitement, surprise, anticipation and anxiety."},"director":{"name":"M. Night Shyamalan","bio":"M. Night Shyamalan is an American filmmaker, philanthropist, and actor. He is known for making original films with contemporary supernatural plots and twist endings. He was born in Mahé, India, and raised in Penn Valley, Pennsylvania.","birthyear":"1970"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/a/a4/The_Sixth_Sense_poster.png","featured":true}
{"_id":{"$oid":"60d8c09dccd1d9750268a4f3"},"name":"The Shining","year":"1980","description":"Jack Torrance (Jack Nicholson) becomes winter caretaker at the isolated Overlook Hotel in Colorado, hoping to cure his writer's block. He settles in along with his wife, Wendy (Shelley Duvall), and his son, Danny (Danny Lloyd), who is plagued by psychic premonitions. As Jack's writing goes nowhere and Danny's visions become more disturbing, Jack discovers the hotel's dark secrets and begins to unravel into a homicidal maniac hell-bent on terrorizing his family.","genre":{"name":"Horror","description":"Horror is a genre of film and television whose purpose is to create feelings of fear, dread, disgust, and terror in the audience. The primary goal is to develop an atmosphere that puts the audience on edge and scares them."},"director":{"name":"Stanley Kubrick","bio":"Stanley Kubrick was an American film director, producer, screenwriter, and photographer. He is frequently cited as one of the greatest filmmakers in cinematic history. His films, which are mostly adaptations of novels or short stories, cover a wide range of genres, and are noted for their realism, dark humor, unique cinematography, extensive set designs, and evocative use of music.","birthyear":"1928","deathyear":"1999"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/thumb/1/1d/The_Shining_%281980%29_U.K._release_poster_-_The_tide_of_terror_that_swept_America_IS_HERE.jpg/220px-The_Shining_%281980%29_U.K._release_poster_-_The_tide_of_terror_that_swept_America_IS_HERE.jpg","featured":true}
{"_id":{"$oid":"60d8c0feccd1d9750268a4f4"},"name":"Spirited Away","year":"2001","description":"In this animated feature by noted Japanese director Hayao Miyazaki, 10-year-old Chihiro (Rumi Hiiragi) and her parents (Takashi Naitô, Yasuko Sawaguchi) stumble upon a seemingly abandoned amusement park. After her mother and father are turned into giant pigs, Chihiro meets the mysterious Haku (Miyu Irino), who explains that the park is a resort for supernatural beings who need a break from their time spent in the earthly realm, and that she must work there to free herself and her parents.","genre":{"name":"Animated","description":"Animated is a genre in which the film's images are primarily created by computer or hand and the characters are voiced by actors. A skillful combination of caricature and artistry, animation amplifies reality, offering stories that are visually stylized, but emotionally truthful."},"director":{"name":"Hayao Miyazaki","bio":"Hayao Miyazaki is a Japanese animator, director, producer, screenwriter, author, and manga artist. A co-founder of Studio Ghibli, a film and animation studio, he has attained international acclaim as a masterful storyteller and as a maker of animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.","birthyear":"1941"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Spirited_Away_Japanese_poster.png/220px-Spirited_Away_Japanese_poster.png","featured":true}
{"_id":{"$oid":"60d8c102ccd1d9750268a4f5"},"name":"Forrest Gump","year":"1994","description":"Slow-witted Forrest Gump (Tom Hanks) has never thought of himself as disadvantaged, and thanks to his supportive mother (Sally Field), he leads anything but a restricted life. Whether dominating on the gridiron as a college football star, fighting in Vietnam or captaining a shrimp boat, Forrest inspires people with his childlike optimism. But one person Forrest cares about most may be the most difficult to save -- his childhood love, the sweet but troubled Jenny (Robin Wright).","genre":{"name":"Drama","description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters."},"director":{"name":"Robert Zemeckis","bio":"Robert Lee Zemeckis is an American film director, film producer, and screenwriter who is frequently credited as an innovator in visual effects.","birthyear":"1951"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/thumb/6/67/Forrest_Gump_poster.jpg/220px-Forrest_Gump_poster.jpg","featured":false}
{"_id":{"$oid":"60d8c105ccd1d9750268a4f6"},"name":"E.T. the Extra-Terrestrial","year":"1982","description":"After a gentle alien becomes stranded on Earth, the being is discovered and befriended by a young boy named Elliott (Henry Thomas). Bringing the extraterrestrial into his suburban California house, Elliott introduces E.T., as the alien is dubbed, to his brother and his little sister, Gertie (Drew Barrymore), and the children decide to keep its existence a secret. Soon, however, E.T. falls ill, resulting in government intervention and a dire situation for both Elliott and the alien.","genre":{"name":"Adventure","description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. Settings play an important role in adventure films, sometimes as big as the characters themselves."},"director":{"name":"Steven Spielberg","bio":"Steven Allan Spielberg is an American film director, producer, and screenwriter. He began his career in the New Hollywood era, and is one of the most commercially successful directors in history. Spielberg is the recipient of various accolades, including two Academy Awards for Best Director, a Kennedy Center honor, and a Cecil B. DeMille Award.","birthyear":"1946"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/thumb/6/66/E_t_the_extra_terrestrial_ver3.jpg/220px-E_t_the_extra_terrestrial_ver3.jpg","featured":true}
{"_id":{"$oid":"60d8c108ccd1d9750268a4f7"},"name":"The 40-Year-Old Virgin","year":"2005","description":"Goaded by his buddies, a nerdy guy who's never 'done the deed' only finds the pressure mounting when he meets a single mother.","genre":{"name":"Comedy","description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"director":{"name":"Judd Apatow","bio":"Judd Apatow is an American producer, writer, director, actor and stand-up comedian.","birthyear":"1967"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/4/43/40-Year-OldVirginMoviePoster.jpg","featured":false}
{"_id":{"$oid":"60d8c10accd1d9750268a4f8"},"name":"Cast Away","year":"2000","description":"A FedEx executive undergoes a physical and emotional transformation after crash landing on a deserted island.","genre":{"name":"Drama","description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters."},"director":{"name":"Robert Zemeckis","bio":"Robert Lee Zemeckis is an American film director, film producer, and screenwriter who is frequently credited as an innovator in visual effects.","birthyear":"1951"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/thumb/a/a7/Cast_away_film_poster.jpg/220px-Cast_away_film_poster.jpg","featured":false}
{"_id":{"$oid":"60d8c10dccd1d9750268a4f9"},"name":"Home Alone","year":"1990","description":"An eight-year-old troublemaker must protect his house from a pair of burglars when he is accidentally left home alone by his family during Christmas vacation.","genre":{"name":"Comedy","description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"director":{"name":"Chris Columbus","bio":"Chris Joseph Columbus is an American film director, producer, and screenwriter. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking. He made his directorial debut with a teen adventure, Adventures in Babysitting, and gained recognition soon after with the highly successful Christmas comedy Home Alone.","birthyear":"1958"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/7/76/Home_alone_poster.jpg","featured":false}
{"_id":{"$oid":"60d8c111ccd1d9750268a4fa"},"name":"The Breaskfast Club","year":"1985","description":"Five high school students meet in Saturday detention and discover how they have a lot more in common than they thought.","genre":{"name":"Drama","description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters."},"director":{"name":"John Hughes","bio":"John Wilden Hughes Jr.was an American filmmaker. Beginning as an author of humorous essays and stories for National Lampoon, he went on to write, produce and sometimes direct some of the most successful live-action comedy films of the 1980s and 1990s","birthyear":"1950","deathyear":"2009"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/thumb/5/50/The_Breakfast_Club.jpg/220px-The_Breakfast_Club.jpg","featured":false}
{"_id":{"$oid":"60d8c2bbccd1d9750268a4fb"},"name":"Silence of the Lambs","year":"1991","description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","genre":{"name":"Thriller","description":"Thrillers are characterized and defined by the moods they elicit, giving viewers heightened feelings of suspense, excitement, surprise, anticipation and anxiety."},"director":{"name":"Jonathan Demme","bio":"Robert Jonathan Demme was an American film director, producer and screenwriter of film and television who earned widespread acclaim.","birthyear":"1944","deathyear":"2017"},"imageURL":"https://upload.wikimedia.org/wikipedia/en/8/86/The_Silence_of_the_Lambs_poster.jpg","featured":false}
